app/Models/GsbModel.php

SELECT `idUtilisateur`, `nom`, `prenom`, `login`, `mdp`, `idRole`, `libelle`
FROM `recup_info_util`
WHERE `login` = 'testcomptable'
AND `mdp` = 'test'
---
    public function get_infos_visiteur($login, $mdp)
    {
        return $this->db->table('recup_info_util')
            ->select('idUtilisateur, nom, prenom, login, mdp, idRole, libelle')
            ->where('login', $login)
            ->where('mdp', $mdp)
            ->get()
            ->getRowArray();

SELECT CONCAT(annee, mois) AS "anneemois", `annee`, `mois`
FROM `fichefrais`
WHERE `idVisiteur` = 'a131'
ORDER BY `annee` DESC, `mois` DESC
---
    public function get_les_mois_disponibles($idVisiteur)
    {
        return $this->db->table('fichefrais')
            ->select('CONCAT(annee,mois) AS "anneemois", annee, mois')
            ->where('idVisiteur', $idVisiteur)
            ->orderBy('annee', 'DESC')
            ->orderBy('mois', 'DESC')
            ->get()
            ->getResultArray();

SELECT `fichefrais`.`idFiche`, `fichefrais`.`idEtat`
FROM `fichefrais`
WHERE `fichefrais`.`idVisiteur` = 'a131'
AND `fichefrais`.`annee` = '2025'
AND `fichefrais`.`mois` = '12'
---
    public function get_id_ficheFrais($idVisiteur, $annee, $mois)
    {
        return $this->db->table('fichefrais')
            ->select('fichefrais.idFiche, fichefrais.idEtat')
            ->where('fichefrais.idVisiteur', $idVisiteur)
            ->where('fichefrais.annee', $annee)
            ->where('fichefrais.mois', $mois)
            ->get()
            ->getRowArray();

SELECT `fichefrais`.`idFiche`, `fichefrais`.`idEtat`, `fichefrais`.`dateModif`, `fichefrais`.`nbJustificatifs`, `fichefrais`.`montantValide`, `etatfrais`.`libelle`
FROM `fichefrais`
JOIN `etatfrais` ON `fichefrais`.`idEtat` = `etatfrais`.`idetat`
WHERE `fichefrais`.`idFiche` = '569'
---
    public function get_les_infos_ficheFrais($idFiche)
    {
        return $this->db->table('fichefrais')
            ->select('fichefrais.idFiche, fichefrais.idEtat, fichefrais.dateModif, fichefrais.nbJustificatifs, fichefrais.montantValide, etatfrais.libelle')
            ->join('etatfrais', 'fichefrais.idEtat = etatfrais.idetat')
            ->where('fichefrais.idFiche', $idFiche)
            ->get()
            ->getRowArray();

SELECT `fraisforfait`.`idfraisforfait`, `fraisforfait`.`libelle`, `lignefraisforfait`.`quantite`
FROM `lignefraisforfait`
JOIN `fraisforfait` ON `fraisforfait`.`idfraisforfait` = `lignefraisforfait`.`idFraisForfait`
WHERE `lignefraisforfait`.`idFiche` = '570'
ORDER BY `lignefraisforfait`.`idFraisForfait` ASC
---
    public function get_les_frais_forfait($idFiche)
    {
        return $this->db->table('lignefraisforfait')
            ->select('fraisforfait.idfraisforfait, fraisforfait.libelle, lignefraisforfait.quantite')
            ->join('fraisforfait', 'fraisforfait.idfraisforfait = lignefraisforfait.idFraisForfait')
            ->where('lignefraisforfait.idFiche', $idFiche)
            ->orderBy('lignefraisforfait.idFraisForfait', 'ASC')
            ->get()
            ->getResultArray();

SELECT *
FROM `lignefraishorsforfait`
WHERE `idFiche` = '570'
---
    public function get_les_frais_hors_forfait($idFiche)
    {
        return $this->db->table('lignefraishorsforfait')
            ->where('idFiche', $idFiche)
            ->get()
            ->getResultArray();

SELECT count(*) AS nblignesfrais
FROM `fichefrais`
WHERE `idVisiteur` = 'a131'
AND `annee` = '2025'
AND `mois` = '12'
---
    public function est_premier_frais_mois($idVisiteur, $annee, $mois)
    {
        $row = $this->db->table('fichefrais')
            ->select('count(*) AS nblignesfrais')
            ->where('idVisiteur', $idVisiteur)
            ->where('annee', $annee)
            ->where('mois', $mois)
            ->get()
            ->getRowArray();

SELECT max(CONCAT(annee, mois)) AS dernierAnneeMois
FROM `fichefrais`
WHERE `idVisiteur` = 'a131'
---
    public function dernier_mois_saisi($idVisiteur)
    {
        $row = $this->db->table('fichefrais')
            ->select('max(CONCAT(annee,mois)) AS dernierAnneeMois')
            ->where('idVisiteur', $idVisiteur)
            ->get()
            ->getRowArray();

SELECT `idfraisforfait`
FROM `fraisforfait`
ORDER BY `idfraisforfait`
---
    public function get_les_id_frais_forfait()
    {
        return $this->db->table('fraisforfait')
            ->select('idfraisforfait')
            ->orderBy('idfraisforfait')
            ->get()
            ->getResultArray();

INSERT INTO `fichefrais` (`idVisiteur`, `annee`, `mois`, `nbJustificatifs`, `montantValide`, `dateModif`, `idEtat`) VALUES ('a131', '2025', '12', 0, 0, '2025-12-04', 'CR')
INSERT INTO `lignefraisforfait` (`idFiche`, `idFraisForfait`, `quantite`) VALUES ('570', 'ETP', 0)
---
    public function cree_nouvelles_lignes_frais($idVisiteur, $annee, $mois)
    {
        $dernierMois = $this->dernier_mois_saisi($idVisiteur);
        $gsb_lib = new Gsb_lib();
        $num_annee = $gsb_lib->get_annee_from_anneemois($dernierMois);
        $num_mois = $gsb_lib->get_mois_from_anneemois($dernierMois);

        $laDerniereFiche = $this->get_id_ficheFrais($idVisiteur, $num_annee, $num_mois);

        if ($laDerniereFiche != null && $laDerniereFiche['idEtat'] == 'CR') {
            $idDerniereFiche = $laDerniereFiche['idFiche'];
            $this->maj_etat_fiche_frais($idDerniereFiche, 'CL');
        }

        $resultat = $this->db->table('fichefrais')->insert([
            'idVisiteur' => $idVisiteur,
            'annee' => $annee,
            'mois' => $mois,
            'nbJustificatifs' => 0,
            'montantValide' => 0,
            'dateModif' => date('Y-m-d'),
            'idEtat' => 'CR'
        ]);

        $insertionsOK = true;
        if ($resultat) {
            // On récupère l'id de la fiche qui vient d'être créée
            $nouvelleFiche = $this->get_id_ficheFrais($idVisiteur, $annee, $mois);
            $idNouvelleFiche = $nouvelleFiche['idFiche'];
            foreach ($this->get_les_id_frais_forfait() as $unIdFraisForfait) {
                $res = $this->db->table('lignefraisforfait')->insert([
                    'idFiche' => $idNouvelleFiche,
                    'idFraisForfait' => $unIdFraisForfait['idfraisforfait'],
                    'quantite' => 0
                ]);

UPDATE `lignefraisforfait` SET `quantite` = '1'
WHERE `idFiche` = '569'
AND `idFraisForfait` = 'ETP'
---
    public function maj_frais_forfait($idFiche, array $lesFrais)
    {
        $majOK = true;
        foreach (array_keys($lesFrais) as $idFrais) {
            $res = $this->db->table('lignefraisforfait')->update(
                ['quantite' => $lesFrais[$idFrais]],
                ['idFiche' => $idFiche, 'idFraisForfait' => $idFrais]
            );

INSERT INTO `lignefraishorsforfait` (`idFiche`, `libelle`, `dateFrais`, `montant`) VALUES ('569', 'testghrsg', '2025-11-22', '10')
---
    public function creer_nouveau_frais_hors_forfait($idFiche, $libelle, $date, $montant)
    {
        $resultat = $this->db->table('lignefraishorsforfait')->insert([
            'idFiche' => $idFiche,
            'libelle' => $libelle,
            'dateFrais' => $date,
            'montant' => $montant
        ]);