app/Models/GsbModel.php

SELECT `DateModif`
FROM `utilisateur`
WHERE `idUtilisateur` = 'a001'
---
    public function get_info_mdp($idVisiteur)
    {
        $result = $this->db->table('utilisateur')
            ->select('DateModif, mdp')
            ->where('idUtilisateur', $idVisiteur)
            ->get()
            ->getRow();